/****************************************************************************
*Copyright：--武汉莱斯特电子科技有限公司--
*File name：	hc595.c
*Author：xx
*ID：YLX-01
*Version：1.0.0
*Date：
*Description：驱动595
*History：
****************************************************************************/

/*引入头文件*/
#include "hc595.h"
#include <STC8.H>

/*引脚定义*/
sbit SER_A = P4^4;
sbit RCK = P2^7;
sbit SCK = P2^6;

sbit SER_B = P0^7;

/****************************************************************************
* 名    称：HC595_Send_
* 功    能：向595发送一个字节的数据
* 入口参数：_dat 要发送的数据
* 出口参数：无
* 说    明：高位在前,接数码管
* 调用方法：无
****************************************************************************/
void HC595_Send_A(unsigned char _dat)
{
	unsigned char i;
	for(i=0;i<8;i++)
	{
		SER_A = (_dat & 0x01);
		SCK=1;
		SCK=0;
		_dat >>= 1;
	}
	RCK = 1;
	RCK = 0;
}


/****************************************************************************
* 名    称：HC595_Send_
* 功    能：向595发送一个字节的数据
* 入口参数：_dat 要发送的数据
* 出口参数：无
* 说    明：高位在前，接LED
* 调用方法：无
****************************************************************************/
void HC595_Send_B(unsigned char _dat)
{
	unsigned char i;
	for(i=0;i<8;i++)
	{
		SER_B = (_dat & 0x01);
		SCK=1;
		SCK=0;
		_dat >>= 1;
	}
	RCK = 1;
	RCK = 0;
}