/****************************************************************************
*Copyright：--武汉莱斯特电子科技有限公司--
*File name：	main.c
*Author：xx
*ID：YLX-01
*Version：1.0.0
*Date：
*Description：下载时晶振选择24M频率，传感器DATA引脚接P3.2
*History：
****************************************************************************/

/*引入头文件*/
#include "timer.h"
#include <STC8.H>
#include <intrins.h>

#include "uart.h"
#include "disp.h"
/*定义IO口*/
sbit DHT11_OUT = P1^4;

/*全局变量*/
static unsigned int OverTime_flag; //超时检测
data unsigned char tick = 0;
/****************************************************************************
* 名    称：timer3初始化
* 功    能：自动重装，1ms
* 入口参数：
* 出口参数：
* 说    明：
* 调用方法：
****************************************************************************/
void Timer3Init(void)		//1毫秒@24.000MHz
{
	T4T3M |= 0x02;		//定时器时钟1T模式
	T3L = 0x40;		//设置定时初值
	T3H = 0xA2;		//设置定时初值
	T4T3M |= 0x08;		//定时器3开始计时
    
    IE2 |= ET3;                                  //使能定时器中断
}

/****************************************************************************
* 名    称：timer4初始化
* 功    能：自动重装，1ms
* 入口参数：
* 出口参数：
* 说    明：
* 调用方法：
****************************************************************************/
void Timer4Init(void)		//1毫秒@24.000MHz
{
    T4T3M |= 0x20;		//定时器时钟1T模式
    T4L = 0x40;		//设置定时初值
    T4H = 0xA2;		//设置定时初值
    T4T3M |= 0x80;		//定时器4开始计时
    
    IE2 |= ET4;          //使能定时器中断
}

/****************************************************************************
* 名    称：timer3 中断函数
* 功    能：
* 入口参数：
* 出口参数：
* 说    明：
* 调用方法：
****************************************************************************/
void TM3_Isr() interrupt 19
{
    //EA = 0;
    AUXINTIF &= ~T3IF;                          //清中断标志
    
    // 串口通信  1ms未接收数据，表示通信结束
    uart4_rx_idle++;
    uart4_tx_idle++;
    
    // 计时
    tick++;

    //EA = 1;
}

void TM4_Isr() interrupt 20
{
    EA = 0;
    AUXINTIF &= ~T4IF;                          //清中断标志
    
    // 串口通信  1ms未接收数据，表示通信结束
    uart4_rx_idle++;
    uart4_tx_idle++;
    
    uart3_rx_idle++;
    uart2_rx_idle++;
    
    // 计时
    tick++;
    EA = 1;
}
